results/finalTests/50_connections/NOQ2.out
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

DB SCHEMA public
DB SCHEMA public
4
DB SCHEMA public
6
7
DB SCHEMA public
2
DB SCHEMA public
0
DB SCHEMA public
5
DB SCHEMA public
DB SCHEMA public
3
9
DB SCHEMA public
1
DB SCHEMA public
11
DB SCHEMA public
10
DB SCHEMA public
8
DB SCHEMA public
15
DB SCHEMA public
12
DB SCHEMA public
DB SCHEMA public
17
13
DB SCHEMA public
14
DB SCHEMA public
18
DB SCHEMA public
16
DB SCHEMA public
25DB SCHEMA public
23DB SCHEMA public
19


DB SCHEMA public
22
DB SCHEMA public
20
DB SCHEMA public
DB SCHEMA public
27
24
DB SCHEMA public
21
DB SCHEMA public
26
DB SCHEMA public
DB SCHEMA public
3228

DB SCHEMA public
DB SCHEMA public
38
35
DB SCHEMA public
34DB SCHEMA public
29

DB SCHEMA public
33
DB SCHEMA public
DB SCHEMA public
31
DB SCHEMA public
36
30
DB SCHEMA public
42
DB SCHEMA public
39
DB SCHEMA public
41
DB SCHEMA public
45
DB SCHEMA public
47DB SCHEMA public
43

DB SCHEMA public
40
DB SCHEMA public
48
DB SCHEMA public
37
DB SCHEMA public
46DB SCHEMA public
49

DB SCHEMA public
44
Threads started!

SQL statistics:
    queries performed:
        read:                            222453
        write:                           228323
        other:                           33812
        total:                           484588
    transactions:                        16856  (1680.16 per sec.)
    queries:                             484588 (48302.39 per sec.)
    ignored errors:                      79     (7.87 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          10.0307s
    total number of events:              16856

Latency (ms):
         min:                                    2.23
         avg:                                   29.71
         max:                                  189.49
         95th percentile:                       50.11
         sum:                               500733.77

Threads fairness:
    events (avg/stddev):           337.1200/10.90
    execution time (avg/stddev):   10.0147/0.01