results/finalTests/50_connections/Q2F.out
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

DB SCHEMA public
0
DB SCHEMA public
10DB SCHEMA public
1

DB SCHEMA public
3
DB SCHEMA public
4
DB SCHEMA public
8
DB SCHEMA public
2
DB SCHEMA public
11
DB SCHEMA public
9
DB SCHEMA public
DB SCHEMA public
7
5
DB SCHEMA public
12
DB SCHEMA public
13
DB SCHEMA public
6
DB SCHEMA public
19DB SCHEMA public
16

DB SCHEMA public
20
DB SCHEMA public
21
DB SCHEMA public
15
DB SCHEMA public
18
DB SCHEMA public
22
DB SCHEMA public
14
DB SCHEMA public
24
DB SCHEMA public
23
DB SCHEMA public
17
DB SCHEMA public
29
DB SCHEMA public
27
DB SCHEMA public
26
DB SCHEMA public
DB SCHEMA public
28
33
DB SCHEMA public
34
DB SCHEMA public
32DB SCHEMA public
35

DB SCHEMA public
47
DB SCHEMA public
49
DB SCHEMA public
48
DB SCHEMA public
25
DB SCHEMA public
30
DB SCHEMA public
40DB SCHEMA public
43

DB SCHEMA public
37
DB SCHEMA public
31
DB SCHEMA publicDB SCHEMA public
42

44
DB SCHEMA public
41
DB SCHEMA public
46
DB SCHEMA public
38
DB SCHEMA public
45
DB SCHEMA public
39DB SCHEMA public
36

Threads started!

SQL statistics:
    queries performed:
        read:                            5874
        write:                           5930
        other:                           1100
        total:                           12904
    transactions:                        550    (1.30 per sec.)
    queries:                             12904  (30.53 per sec.)
    ignored errors:                      1      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          422.5927s
    total number of events:              550

Latency (ms):
         min:                                    1.61
         avg:                                37740.67
         max:                               212398.79
         95th percentile:                   100000.00
         sum:                             20757371.12

Threads fairness:
    events (avg/stddev):           11.0000/0.00
    execution time (avg/stddev):   415.1474/2.43